Repository: navferty/NavfertyExcelAddIn
Catalog: NavfertyExcelAddIn/Localization/RibbonLabels.*.resx
Languages: ru_ru

source: Parse Numerics
ru_ru: Парсинг чисел

# UnprotectWorkbook
source: Remove file protection
ru_ru: Защита файла

source: Cut Names
ru_ru: Сократить имена организаций

source: Highlight Duplicates
ru_ru: Подсветка дублей

source: Toggle Case
ru_ru: Изменить регистр

source: Trim Spaces
ru_ru: Очистить пробелы

source: Unmerge Cells
ru_ru: Разъединение ячеек с заполнением

# CreateSampleXml
source: Create Sample XML based on XSD
ru_ru: Создать образец XML (по XSD)

# ValidateXml
source: Validate XML with XSD
ru_ru: Валидация XML по XSD

# CommonGroup
source: Commons
ru_ru: Общие

# XmlToolsGroup
source: XML Tools
ru_ru: Работа с XML

# FindErrors
source: Find Formula Errors in the selected range
ru_ru: Найти все ошибки

source: Copy as Markdown
ru_ru: Копировать в Markdown

# ValidateValuesButton
source: Validate Values
ru_ru: Валидация

# ValidateValuesDate
source: Date
ru_ru: Дата

# ValidateValuesNumerics
source: Numerics
ru_ru: Число

# ValidateValuesTinOrganization
source: Russian TIN (Organization)
ru_ru: ИНН ЮЛ

# ValidateValuesTinPersonal
source: Russian TIN (Personal)
ru_ru: ИНН ФЛ

# ValidateValuesXml
source: XML contents text
ru_ru: Текст для XML

# Transliterate
source: With Transliteration 'У' -> 'U'
ru_ru: Транслитерацией 'У' -> 'U'

# ReplaceChars
source: Replace Chars 'У' -> 'Y'
ru_ru: На аналоги 'У' -> 'Y'

# TransliterateButton
source: Replace
ru_ru: Заменить

source: Converting Values
ru_ru: Преобразование значений

source: Formatting Values
ru_ru: Форматирование значений

# StringifyNumericsButton
source: Stringify Numerics
ru_ru: Число словами

# StringifyNumericsEn
source: ...to English
ru_ru: На английском

# StringifyNumericsRu
source: ...to Russian
ru_ru: На русском

# StringifyNumericsFr
source: ...to French
ru_ru: На французском

source: Control
ru_ru: Управление

source: Undo Last Action
ru_ru: Отменить

# SwitchReferenceStyle
source: Switch Reference Style (A1/R1C1)
ru_ru: Изменить стиль ссылок (A1/R1C1)

# ToggleSheetLabels
source: Toggle Sheet Labels Display
ru_ru: Отобразить/скрыть значки листов

# ViewGroup
source: View
ru_ru: Вид

source: Remove All Spaces
ru_ru: Удалить все пробелы

source: Trim Extra Spaces
ru_ru: Очистить лишние пробелы

# RepairConditionalFormat
source: Repair Conditional Formatting
ru_ru: Починить условное форматирование

# ProtectUnprotectWorksheets
source: Worksheets protection
ru_ru: Защита листов
