Repository: navferty/NavfertyExcelAddIn
Catalog: NavfertyExcelAddIn/Localization/RibbonSupertips.*.resx
Languages: ru_ru

# ParseNumerics
source: Convert the cell data type to a numeric one.
ru_ru: Преобразовывает тип данных ячейки в числовой.

# CutNames
source: In the development...
ru_ru: В разработке...

# HighlightDuplicates
source: Paint groups of duplicates with different colors.
ru_ru: Закрашивает группы дубликатов разным цветом.

# ToggleCase
source: Change the case of all words in the cell. Replacement order: lowercase, uppercase, first capital, lowercase...
ru_ru: Меняет регистр всех слов ячейки. Порядок замены: нижний регистр, верхний регистр, первая заглавная, нижний регистр...

# TrimSpaces
source: Trim or remove spaces, tabs and 'new line' symbols.
ru_ru: Очищает ячейки от пробелов, табуляций и переносов строк.

# UnmergeCells
source: Split merged cells and fill each cell with original content.
ru_ru: Разделяет объединенные ячейки с дублированием их содержимого.

# FindErrors
source: Find all cells in the specified range that have any errors (#).
ru_ru: Находит на текущем листе (или в выбранном диапазоне, если он выбран) все ячейки, имеющие любые ошибки (#).

# CopyAsMarkdown
source: Save the selected range of values to the clipboard using Markdown markup.
ru_ru: Сохраняет выделенный диапазон значений в буфер обмена с использованием разметки Markdown.

# Transliterate
source: Change the Russian alphabet to English using transliteration, for example: 'У' - > 'U'.
ru_ru: Меняет русский алфавит на английский с использованием транслитерации, например: 'У' -> 'U'.

# TransliterateButton
source: Full using transliteration (by default) or partial replacement of the Russian alphabet (by analogy) with English. Example of transliteration: 'У' - > 'U', example of substitution by analogy:' У ' - > 'Y'.
ru_ru: Полная с использованием транслитерации (по умолчанию) или частичная замена русского алфавита (по аналогии) на английский. Пример транслитерации: 'У' -> 'U', пример замены по аналогии: 'У' -> 'Y'.

# ReplaceChars
source: Change similar letters of the Russian and English alphabets, for example: 'У' - > 'Y'.
ru_ru: Меняет схожие буквы русского и английского алфавитов, например: 'У' -> 'Y'.

# StringifyNumericsButton
source: Rewrite the numeric value of the cell with words. The default is the Russian language. Allows rewriting values in range -999 billion to 999 billion, with precision up to thousandths.
ru_ru: Переписывает словами числовое значение ячейки. По умолчанию используется русский язык. Диапазон значений от -999 миллиардов до 999 миллиардов, с точностью до тысячных.

# StringifyNumericsEn
source: Rewrite the numeric value of a cell in English with words.
ru_ru: Переписывает словами числовое значение ячейки на английском языке.

# StringifyNumericsRu
source: Rewrite the numeric value of a cell in Russian with words.
ru_ru: Переписывает словами числовое значение ячейки на русском языке.

# ValidateValuesButton
source: Checking values against standards selected with drop down.
ru_ru: Проверяет на соответствие значений определённым стандартам. Используйте всплывающий список для выбора стандарта.

# StringifyNumericsFr
source: Rewrite the numeric value of a cell in French with words.
ru_ru: Переписывает словами числовое значение ячейки на французском языке.

# UndoLastAction
source: Undo the latest action done with this add-in. The undo is possible for certain functions in the sections 'Converting Values' and 'Formatting Values' and only in case the cells' values have not been changed after that action.
ru_ru: Отменяет последнее действие, совершённое с помощью данной надстройки. Отмена возможна для некоторых функций в разделах 'Преобразование значений' и 'Форматирование значений' и только, если диапазон ячеек не редактировался после совершения действия.

# RemoveAllSpaces
source: Remove all spaces in selected cells or entire sheet
ru_ru: Удаляет все пробельные символы в значениях выделенных ячеек.

# TrimExtraSpaces
source: Trim extra spaces in cell values. Remove all trailing spaces, replace duplicated spaces in the middle of cell values.
ru_ru: Удаляет пробелы по краям значений ячеек, заменяет дублированные пробелы внутри значений ячеек до одного.

# RepairConditionalFormat
source: Fill conditional formatting in entire table, with rules based on first table row
ru_ru: Применяет правила условного форматирования для выделенной таблицы, взяв за образец правила из первой строки выделенного диапазона.

# ProtectUnprotectWorksheets
source: Set or remove Worksheets protection for current Workbook
ru_ru: Установить или снять защиту листов текущей книги

# UnprotectWorkbook
source: Unprotect Workbook file
ru_ru: Снять защиту книги и листов (для файла)

# CurrencyExchangeRatesSelect
source: Select A Currency Exchange Rate From An Online Source And Paste Into The Current Cell
ru_ru: Выбрать курс валюты из интернет-источника и вставить в текущую ячейку

# CreateSampleXml
source: Create Sample XML based on XSD-file
ru_ru: Создать образец XML на основе XSD-файла

# SwitchReferenceStyle
source: Switch Formula Reference Style (A1/R1C1)
ru_ru: Изменить стиль ссылок на ячейки в формулах (A1/R1C1)

# ToggleSheetLabels
source: Show or hide worksheet tabs
ru_ru: Отобразить или скрыть ярлычки листов
