Repository: navferty/NavfertyExcelAddIn
Catalog: NavfertyExcelAddIn/Localization/UIStrings.*.resx
Languages: ru_ru

# Address
source: Range Address
ru_ru: Адрес ячейки

# CannotUnlockPleaseSaveAsXml
source: Cannot unlock workbook contents because of wrong workbook format. Please save workbook as xlsx or xlsm and try again
ru_ru: Для разброкировки содержимого сохраните книгу в формате .xlsx или .xlsm

# CurrencyExchangeRates_Error_CanSelectOnlyOneRow
source: You can select only one row to insert!
ru_ru: Можно выбрать только одну строку для вставки!

# CurrencyExchangeRates_Error_NedAnyCellSelection
source: You must select a cell in the table!
ru_ru: Необходимо выбрать ячейку в таблице!

# CurrencyExchangeRates_Error_Network
source: Failed to get data from online source due to network error!
ru_ru: Не удалось получить данные с онлайн источника из-за сетевой ошибки!

# CurrencyExchangeRates_Error_NotAvailYet
source: {0}, currently does not provide data for {1}! Please try again later, or specify a different date.
ru_ru: {0}, на данный момент, не предоставляет данных за {1}! Попробуйте повторить запрос позже, или укажите другую дату.

# CurrencyExchangeRates_Error_ParseError
source: Unable to parse data from online source due to data format error!
ru_ru: Не удалось разобрать данные с онлайн источника из-за ошибки в формате данных!

# CurrencyExchangeRates_FilterDescription
source: Filter by currency name and code
ru_ru: Фильтр по наименованию и коду валюты

# CurrencyExchangeRates_FilterTitle
source: Rows Filter:
ru_ru: Отбор строк:

# CurrencyExchangeRates_FormTitle
source: Exchange Rates
ru_ru: Курсы валют

# CurrencyExchangeRates_GridColumn_ISO
source: Code
ru_ru: Код

# CurrencyExchangeRates_GridColumn_Name
source: Currency
ru_ru: Валюта

# CurrencyExchangeRates_GridColumn_Rate
source: Exchange Rate
ru_ru: Курс

# CurrencyExchangeRates_PasteToCell
source: Insert Into Worksheet Cell
ru_ru: Вставить в ячейку листа

# CurrencyExchangeRates_Source
source: Data Source:
ru_ru: Источник данных:

# CurrencyExchangeRates_Sources_CBRF
source: Central Bank of the Russian Federation (Bank of Russia)
ru_ru: Центральный банк Российской Федерации (Банк России)

# CurrencyExchangeRates_Sources_ECB
source: European Central Bank
ru_ru: Европейский центральный банк

# CurrencyExchangeRates_Sources_NBU
source: National Bank of Ukraine
ru_ru: Національний банк України

# CurrencyExchangeRates_UnitsFormat
source: for {0} units
ru_ru: за {0} единиц

source: Error
ru_ru: Ошибка

# ErrorMessage
source: Error occured: {0}
ru_ru: Произошла ошибка: {0}

source: Formula
ru_ru: Формула

source: Info
ru_ru: Внимание

# NoErrors
source: Found no errors in range {0}
ru_ru: В диапазоне {0} ошибок не найдено

# NoMatchingWorkSheets
source: No matching sheets in the workbook
ru_ru: Нет подходящих листов в книге

source: Search Results
ru_ru: Результаты поиска

# SheetProtectionFlag_Contents
source: contents
ru_ru: содержимое

# SheetProtectionFlag_DrawingObjects
source: shapes
ru_ru: фигуры

# SheetProtectionFlag_Scenarios
source: scenarios
ru_ru: сценарии

# SheetProtectionFlag_UI
source: user interface
ru_ru: пользовательский интерфейс

# SheetProtection_Clear
source: Clear
ru_ru: Снять

# SheetProtection_Execute
source: Execute
ru_ru: Выполнить

# SheetProtection_Password
source: Password:
ru_ru: Пароль:

# SheetProtection_PasswordBanner
source: Enter password for worksheets (not required)...
ru_ru: Укажите пароль для листов (необязательно)...

# SheetProtection_Protected
source: Protected
ru_ru: Защищено

# SheetProtection_ProtectionForSheets
source: protection for sheets:
ru_ru: защиту следующих листов книги:

# SheetProtection_Set
source: Set
ru_ru: Установить

# ShowVersionMessage
source: Navferty Excle add-in. Published under MIT licence. Version
ru_ru: Надстройка Navferty, публикуется под лицензией MIT. Версия

# SuccessfullyValidatedMessage
source: Successfully validated, no errors or warnings detected
ru_ru: Валидация успешна, ошибок не обнаружено

# UnsavedChangesWillBeLostPrompt
source: Any unsaved changes will be lost. Active workbook may become corrupted. It is strongly recommended to create backup. Continue?
ru_ru: Несохранённые изменения будут утеряны. Книга может оказаться повреждённой: настоятельно рекомендуется предварительно создать копию. Продолжить?

# VbaUnprotected
source: VBA project unprotected. To enable viewing source code go to VBA project properties in VBE editor, tab Protection, set any password and press OK. Then you can disable password by unchecking the option Lock project for viewing.
ru_ru: Проект VBA разблокирован. Чтобы получить доступ к содержимому VBA-проекта, откройте свойста проекта в редакторе VBE, и на вкладке Protection установите любой пароль и нажмите OK. После этого Вы можете удалить пароль путем снятия опции Lock project for viewing.

source: Warning!
ru_ru: Внимание

# WorkSheetsNotFound
source: Workbook '{0}' have no worksheets!
ru_ru: Книга '{0}' не содержит листов!

# WsName
source: Worksheet Name
ru_ru: Имя листа

# XmlValidationReport_ElementName
source: Element
ru_ru: Элемент

# XmlValidationReport_Message
source: Message
ru_ru: Ошибка

# XmlValidationReport_Severity
source: Severity
ru_ru: Уровень

# XmlValidationReport_Value
source: Value
ru_ru: Значение
